Tekla Open API Reference for Tekla Structures 2025
ProfileSelectionForm Constructor (List<LibraryProfileItem>, List<ParametricProfileItem>)
 Creates a new instance of the ProfileSelectionForm.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileSelectionForm(
	List<LibraryProfileItem> LibraryProfiles,
	List<ParametricProfileItem> ParametricProfiles
)
Public Sub New (
	LibraryProfiles As List(Of LibraryProfileItem),
	ParametricProfiles As List(Of ParametricProfileItem)
)
Parameters
LibraryProfiles
Type: System.Collections.Generic.List<LibraryProfileItem>
The library profiles to be added to the dialog.
ParametricProfiles
Type: System.Collections.Generic.List<ParametricProfileItem>
The parametric profiles to be added to the dialog.
See Also
Reference
ProfileSelectionForm Class
ProfileSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace